# IdeaStatiCa.RcsApi.Model.PinGrid
Data of the pin grid

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**IsReplaceable** | **bool** | Replaceable pin | [optional]
**Pin** | **ReferenceElement** |  | [optional]
**Origin** | **Point3D** |  | [optional]
**AxisX** | **Vector3D** |  | [optional]
**AxisY** | **Vector3D** |  | [optional]
**AxisZ** | **Vector3D** |  | [optional]
**Positions** | **List&lt;Point3D&gt;** | Positions of holes in the local coordinate system of the grid | [optional]
**ConnectedParts** | **List&lt;ReferenceElement&gt;** | List of the connected parts | [optional]
**Name** | **string** | Name | [optional]
**Length** | **double** | Length | [optional]
**Id** | **int** | Element Id | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)